build/docs/project/findings/survey.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-09 Fri 10:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd046109">1. Given Starting Reference sites</a>
<ul>
<li><a href="#org8f8bfbc">1.1. Oauth Starting Point</a></li>
<li><a href="#org372ab91">1.2. Good Article to refer, HIGHLY Relevant</a></li>
<li><a href="#orgcea9039">1.3. Mobile related</a></li>
</ul>
</li>
<li><a href="#org7e7579a">2. Definitions</a></li>
<li><a href="#org11df912">3. Major methods of Approach</a></li>
<li><a href="#orgbe068fe">4. Articles to Refer to</a>
<ul>
<li><a href="#org2829e83">4.1. Snippets of Code</a></li>
</ul>
</li>
<li><a href="#orgefd44fa">5. Analysis So far</a>
<ul>
<li><a href="#org3ba4881">5.1. JWT</a>
<ul>
<li><a href="#orgfb40257">5.1.1. Advantages</a></li>
<li><a href="#org49e2ab8">5.1.2. Disadvantages</a></li>
<li><a href="#org4fcc088">5.1.3. References</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org89c4e79">6. Separate Ideas</a></li>
<li><a href="#orgca9024b">7. Architecture Styles</a>
<ul>
<li><a href="#orgbf2e353">7.1. Bouncer</a></li>
<li><a href="#orgc0a0d8e">7.2. AuthBearer</a></li>
</ul>
</li>
<li><a href="#org9adb74c">8. Implementation</a>
<ul>
<li><a href="#org5c688b2">8.1. Diagram</a></li>
<li><a href="#orgb61fa59">8.2. Python</a></li>
<li><a href="#org93ae50f">8.3. Example in Node</a></li>
</ul>
</li>
<li><a href="#orgfaca873">9. Questions</a>
<ul>
<li><a href="#org9dda9c1">9.1. Authentication System</a></li>
<li><a href="#org1d46371">9.2. Implementation</a></li>
</ul>
</li>
<li><a href="#orgc211156">10. <span class="todo TODO">TODO</span> Requirements</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd046109" class="outline-2">
<h2 id="orgd046109"><span class="section-number-2">1</span> Given Starting Reference sites</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org8f8bfbc" class="outline-3">
<h3 id="org8f8bfbc"><span class="section-number-3">1.1</span> Oauth Starting Point</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="http://searchmicroservices.techtarget.com/definition/OAuth">http://searchmicroservices.techtarget.com/definition/OAuth</a></li>
</ul>
</div>
</div>

<div id="outline-container-org372ab91" class="outline-3">
<h3 id="org372ab91"><span class="section-number-3">1.2</span> Good Article to refer, HIGHLY Relevant</h3>
<div class="outline-text-3" id="text-1-2">
<p>
-<a href="https://medium.facilelogin.com/securing-microservices-with-oauth-2-0-jwt-and-xacml-d03770a9a838">https://medium.facilelogin.com/securing-microservices-with-oauth-2-0-jwt-and-xacml-d03770a9a838</a>
</p>
</div>
</div>

<div id="outline-container-orgcea9039" class="outline-3">
<h3 id="orgcea9039"><span class="section-number-3">1.3</span> Mobile related</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://digitalleaves.com/blog/2014/05/building-your-own-rest-api-with-oauth-2-0-i-the-basics/">https://digitalleaves.com/blog/2014/05/building-your-own-rest-api-with-oauth-2-0-i-the-basics/</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7e7579a" class="outline-2">
<h2 id="org7e7579a"><span class="section-number-2">2</span> Definitions</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>authentication - Checking if the person is someone who he really claims to
be; you do this by providing a username + password.</li>

<li>authorization - Checking if the person has the right to access some
resource. This is usually done by giving a token generated by the
authentication process, or something like that.</li>
</ul>
</div>
</div>

<div id="outline-container-org11df912" class="outline-2">
<h2 id="org11df912"><span class="section-number-2">3</span> Major methods of Approach</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://gist.github.com/andineck/0ed33faf686560f71234">https://gist.github.com/andineck/0ed33faf686560f71234</a></li>

<li>The project as described identifies with Approach 1: creating an independent
unit that can authorize and authenticate between micro-services (?</li>
</ul>
<p>
)
</p>
</div>
</div>
<div id="outline-container-orgbe068fe" class="outline-2">
<h2 id="orgbe068fe"><span class="section-number-2">4</span> Articles to Refer to</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org2829e83" class="outline-3">
<h3 id="org2829e83"><span class="section-number-3">4.1</span> Snippets of Code</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://medium.com/technology-learning/how-we-solved-authentication-and-authorization-in-our-microservice-architecture-994539d1b6e6">https://medium.com/technology-learning/how-we-solved-authentication-and-authorization-in-our-microservice-architecture-994539d1b6e6</a></li>

<li>They used a combination of JWT(user logs in, JWT given. Subsequent requests
carry the token)</li>

<li>Permissions are placed in the token</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgefd44fa" class="outline-2">
<h2 id="orgefd44fa"><span class="section-number-2">5</span> Analysis So far</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org3ba4881" class="outline-3">
<h3 id="org3ba4881"><span class="section-number-3">5.1</span> JWT</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>We need to use JSON Web Tokens (JWT) to create this service.</li>

<li>This can be used concurrently with Oauth2.0, which is a security
framework.(not required to do so though)</li>

<li>Can put all user information especially permissions in each token, and pass
the token between services.</li>
</ul>
</div>

<div id="outline-container-orgfb40257" class="outline-4">
<h4 id="orgfb40257"><span class="section-number-4">5.1.1</span> Advantages</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>Usage of JWT instead will help create a RESTful service(stateless). It would
remove the use of sessions and the overheads attached.</li>

<li>JWT are JSON so take up very little space.</li>

<li>JWT can hold user data and expiry time</li>

<li>You can have one authorization server that deals with the Login/Registration
and generates the token, all the subsequent requests will need not have to go
to the authorization server as the only the Auth-server will have have the
private key, and rest of the severs will have the public-key to verify the
signature.</li>
</ul>
</div>
</div>

<div id="outline-container-org49e2ab8" class="outline-4">
<h4 id="org49e2ab8"><span class="section-number-4">5.1.2</span> Disadvantages</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>Relies on a single key for decryption of data. If the key is compromised the
only way to resecure the system would be to log all users out and generate a
new key.</li>

<li>Data overhead, as the token needs to be passed around.</li>
</ul>
</div>
</div>

<div id="outline-container-org4fcc088" class="outline-4">
<h4 id="org4fcc088"><span class="section-number-4">5.1.3</span> References</h4>
<div class="outline-text-4" id="text-5-1-3">
<ul class="org-ul">
<li><a href="https://float-middle.com/json-web-tokens-jwt-vs-sessions/">https://float-middle.com/json-web-tokens-jwt-vs-sessions/</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org89c4e79" class="outline-2">
<h2 id="org89c4e79"><span class="section-number-2">6</span> Separate Ideas</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Can we have a JWT for the login session globally rather than pass it around,
and have a check between each of the microservices. This style of
implementation would be similar to the use of session. This can be done when
authorization is user dependent(not dependent on which microservice is making
a call)</li>
</ul>
</div>
</div>

<div id="outline-container-orgca9024b" class="outline-2">
<h2 id="orgca9024b"><span class="section-number-2">7</span> Architecture Styles</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgbf2e353" class="outline-3">
<h3 id="orgbf2e353"><span class="section-number-3">7.1</span> Bouncer</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a href="https://www.appsflyer.com/blog/how-we-solved-authentication-and-authorization-in-our-microservices-architecture/">https://www.appsflyer.com/blog/how-we-solved-authentication-and-authorization-in-our-microservices-architecture/</a>
</p>

<ul class="org-ul">
<li>This interacts with the user and takes care of auth.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc0a0d8e" class="outline-3">
<h3 id="orgc0a0d8e"><span class="section-number-3">7.2</span> AuthBearer</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<a href="https://hashnode.com/post/best-way-to-perform-authentication-between-microservices-cijyn2b6o00kzco53cr3xcs50">https://hashnode.com/post/best-way-to-perform-authentication-between-microservices-cijyn2b6o00kzco53cr3xcs50</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org9adb74c" class="outline-2">
<h2 id="org9adb74c"><span class="section-number-2">8</span> Implementation</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-org5c688b2" class="outline-3">
<h3 id="org5c688b2"><span class="section-number-3">8.1</span> Diagram</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<a href="https://www.slideshare.net/leanIX_net/authorization-and-authentication-in-microservice-environments">https://www.slideshare.net/leanIX_net/authorization-and-authentication-in-microservice-environments</a>
</p>
</div>
</div>

<div id="outline-container-orgb61fa59" class="outline-3">
<h3 id="orgb61fa59"><span class="section-number-3">8.2</span> Python</h3>
<div class="outline-text-3" id="text-8-2">
<p>
<a href="http://blog.apcelent.com/json-web-token-tutorial-with-example-in-python.html">http://blog.apcelent.com/json-web-token-tutorial-with-example-in-python.html</a>
</p>
</div>
</div>

<div id="outline-container-org93ae50f" class="outline-3">
<h3 id="org93ae50f"><span class="section-number-3">8.3</span> Example in Node</h3>
<div class="outline-text-3" id="text-8-3">
<p>
<a href="https://jwt.io/introduction/">https://jwt.io/introduction/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgfaca873" class="outline-2">
<h2 id="orgfaca873"><span class="section-number-2">9</span> Questions</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org9dda9c1" class="outline-3">
<h3 id="org9dda9c1"><span class="section-number-3">9.1</span> Authentication System</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Current Auth System?</li>

<li>Do we want to have oauth style authentication? Allowing login through other
accounts essentially. If so, scope of the project needs to be changed.</li>

<li>Aim is authorization between user and microservice or between 2 microservices.</li>
</ul>
</div>
</div>

<div id="outline-container-org1d46371" class="outline-3">
<h3 id="org1d46371"><span class="section-number-3">9.2</span> Implementation</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>If we choose to go along with JWT, changes will need to be made to all
services, not just one. Validation of a key, and information should be pulled
from the token.</li>
</ul>
</div>
</div>
</div>







<div id="outline-container-orgc211156" class="outline-2">
<h2 id="orgc211156"><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> Requirements</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Authorization between Microservices</li>
<li></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-09 Fri 10:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
